import React from "react";
import styled from "styled-components";
import { Footer } from "../components_ar";
import { NavbarWelcome } from "../components_ar/Navigations";

const PrivacyPolicyPage = () => {
  return (
    <>
      <NavbarWelcome></NavbarWelcome>
      <Wrapper>
        <div class="privacy">
          <h2 class="privacy__title">سياسة الخصوصية</h2>

          <p class="privacy__paragraph">آخر تحديث: 21 أكتوبر 2021</p>

          <p class="privacy__paragraph">
            تصف سياسة الخصوصية هذه سياساتنا وإجراءاتنا على جمع المعلومات الخاصة
            بك واستخدامها والإفصاح عنها عند استخدامك لـ خدمة ويخبرك عن حقوق
            الخصوصية الخاصة بك وكيف القانون يحميك.{" "}
          </p>

          <p class="privacy__paragraph">
            نستخدم بياناتك الشخصية لتوفير الخدمة وتحسينها. بواسطة باستخدام
            الخدمة ، فإنك توافق على جمع واستخدام المعلومات وفقًا لسياسة الخصوصية
            هذه.{" "}
          </p>

          <h2 class="privacy__title">التفسير والتعريفات</h2>

          <h2 class="privacy__subtitle">ترجمة</h2>

          <p class="privacy__paragraph">
            الكلمات التي يتم كتابة الحرف الأول بها معاني المحددة بموجب الشروط
            التالية. التعاريف التالية يجب أن يكون لها نفس المعنى بغض النظر عما
            إذا كانت تظهر فيه المفرد أو الجمع.
          </p>

          <h2 class="privacy__subtitle">تعريفات</h2>

          <p class="privacy__paragraph">
            الكلمات التي يتم كتابة الحرف الأول بها معاني المحددة بموجب الشروط
            التالية. التعاريف التالية يجب أن يكون لها نفس المعنى بغض النظر عما
            إذا كانت تظهر فيه المفرد أو الجمع.
          </p>

          <p class="privacy__paragraph">لأغراض سياسة الخصوصية هذه.</p>

          <ul class="privacy__ul">
            <li class="privacy__li">
              <p class="privacy__paragraph">
                {" "}
                <strong>الحساب</strong> يعني حسابًا فريدًا تم إنشاؤه لك للوصول  
                إلى خدمتنا أو أجزاء من خدمتنا.
              </p>
            </li>
            <li class="privacy__li">
              <p class="privacy__paragraph">
                {" "}
                <strong>شركة</strong> (يشار إليها باسم "الشركة" ، تشير كلمة "نحن" 
                أو "نحن" أو "خاصتنا" في هذه الاتفاقية) إلى مقاول ، رقم العقار
                (XIII-CC-51 / BB / YY / KK) ، شارع رقم 9 ، سنترال مانشستر ،
              </p>
            </li>
            <li class="privacy__li">
              <p class="privacy__paragraph">
                {" "}
                <strong>بسكويت</strong>
                 هي ملفات صغيرة يتم وضعها على ملف جهاز كمبيوتر أو جهاز محمول أو
                أي جهاز آخر عن طريق موقع ويب ، تحتوي على تفاصيل محفوظات
                الاستعراض الخاصة بك على هذا الموقع من بين استخداماته المتعددة{" "}
              </p>
            </li>
            <li class="privacy__li">
              <p class="privacy__paragraph">
                {" "}
                <strong>دولة</strong>يشير إلى : المملكة العربية السعودية{" "}
              </p>
            </li>
            <li class="privacy__li">
              <p class="privacy__paragraph">
                {" "}
                <strong>جهاز</strong> يعني أي جهاز يمكنه الوصول إلى الخدمة مثل
                جهاز كمبيوتر أو هاتف محمول أو جهاز لوحي رقمي.
              </p>
            </li>
            <li class="privacy__li">
              <p class="privacy__paragraph">
                {" "}
                <strong>بيانات شخصية</strong> هي أي معلومات تتعلق فرد محدد أو
                يمكن التعرف عليه.
              </p>
            </li>
            <li class="privacy__li">
              <p class="privacy__paragraph">
                {" "}
                <strong>خدمة</strong> يشير إلى الموقع
              </p>
            </li>
            <li class="privacy__li">
              <p class="privacy__paragraph">
                {" "}
                <strong>مقدم الخدمة</strong> تعني أي شخص طبيعي أو اعتباري من
                يقوم بمعالجة البيانات نيابة عن الشركة. تشير إلى شركات الطرف
                الثالث أو الأفراد الذين يعملون لدى الشركة تسهيل الخدمة ، لتقديم
                الخدمة نيابة عن الشركة ، لأداء الخدمات المتعلقة بالخدمة أو
                للمساعدة الشركة في تحليل كيفية استخدام الخدمة.
              </p>
            </li>
            <li class="privacy__li">
              <p class="privacy__paragraph">
                {" "}
                <strong>بيانات الاستخدام</strong> يشير إلى البيانات التي تم
                جمعها تلقائيًا ، إما عن طريق استخدام الخدمة أو من البنية التحتية
                للخدمة نفسها (على سبيل المثال ، ملف مدة زيارة الصفحة).
              </p>
            </li>
            <li class="privacy__li">
              <p class="privacy__paragraph">
                {" "}
                <strong>موقع الكتروني</strong> يشير إلى maqawal.com ، يمكن
                الوصول إليه من
                <a href="https://www.maqawal.com/">www.maqawal.com</a>
              </p>
            </li>
            <li class="privacy__li">
              <p class="privacy__paragraph">
                {" "}
                <strong>أنت</strong>يعني الفرد الذي يصل إلى أو يستخدم الخدمة أو
                الشركة أو أي كيان قانوني آخر نيابة عن أي فرد يصل إلى الخدمة أو
                يستخدمها ، مثل المعمول بها.
              </p>
            </li>
          </ul>

          <h2 class="privacy__title">جمع واستخدام بياناتك الشخصية</h2>

          <h2 class="privacy__subtitle">أنواع البيانات المجمعة</h2>

          <p class="privacy__sub">بيانات شخصية</p>

          <p class="privacy__paragraph">
            أثناء استخدام خدمتنا ، قد نطلب منك تزويدنا ببعض معلومات التعريف
            الشخصية التي يمكن استخدامها للاتصال أو عرف عن نفسك. قد تتضمن معلومات
            التعريف الشخصية ، ولكن لا يقتصر على:
          </p>

          <ul class="privacy__ul">
            <li class="privacy__li">
              <p class="privacy__paragraph"> عنوان البريد الالكترونى</p>
            </li>
            <li class="privacy__li">
              <p class="privacy__paragraph"> الاسم الأول واسم العائلة</p>
            </li>
            <li class="privacy__li">
              <p class="privacy__paragraph"> رقم الهاتف</p>
            </li>
            <li class="privacy__li">
              <p class="privacy__paragraph">
                {" "}
                العنوان ، الولاية ، المقاطعة ، الرمز البريدي / الرمز البريدي ،
                المدينة
              </p>
            </li>
            <li class="privacy__li">
              <p class="privacy__paragraph">بيانات الاستخدام</p>
            </li>
          </ul>

          <p class="privacy__sub">بيانات الاستخدام</p>

          <p class="privacy__paragraph">
            يتم جمع بيانات الاستخدام تلقائيًا عند استخدام الخدمة.
          </p>

          <p class="privacy__paragraph">
            قد تتضمن بيانات الاستخدام معلومات مثل الإنترنت الخاص بجهازك عنوان
            البروتوكول (مثل عنوان IP) ، ونوع المتصفح ، وإصدار المتصفح ، صفحات
            خدمتنا التي تزورها ، ووقت وتاريخ الزيارة والوقت المستغرق في تلك
            الصفحات ومعرفات الجهاز الفريدة و بيانات التشخيص الأخرى.{" "}
          </p>

          <p class="privacy__paragraph">
            عندما تصل إلى الخدمة عن طريق أو من خلال جهاز محمول ، يجوز لنا ذلك
            جمع معلومات معينة تلقائيًا ، بما في ذلك ، على سبيل المثال لا الحصر
            يقتصر على نوع الجهاز المحمول الذي تستخدمه ، جهازك المحمول معرف فريد
            ، عنوان IP لجهازك المحمول ، هاتفك المحمول نظام التشغيل ، نوع متصفح
            الإنترنت على الهاتف المحمول الذي تستخدمه ، معرّفات الجهاز الفريدة
            وبيانات التشخيص الأخرى.
          </p>

          <p class="privacy__paragraph">
            قد نقوم أيضًا بجمع المعلومات التي يرسلها متصفحك متى شئت قم بزيارة
            خدمتنا أو عندما تصل إلى الخدمة عن طريق أو من خلال أ جهاز محمول.{" "}
          </p>

          <p class="privacy__sub">تقنيات التتبع وملفات تعريف الارتباط</p>

          <p class="privacy__paragraph">
            نحن نستخدم ملفات تعريف الارتباط وتقنيات التتبع المماثلة لتتبع ملفات
            النشاط على خدمتنا وتخزين معلومات معينة. تتبع التقنيات المستخدمة هي
            إشارات وعلامات ونصوص لجمع و تتبع المعلومات ولتحسين خدمتنا وتحليلها.
            ال التقنيات التي نستخدمها قد تشمل:{" "}
          </p>
          <ul class="privacy__ul">
            <li class="privacy__li">
              <p class="privacy__paragraph">
                <strong>
                  {" "}
                  ملفات تعريف الارتباط أو ملفات تعريف ارتباط المتصفح.
                </strong>
                ملف تعريف الارتباط هو ملف صغير وضع الملف على جهازك. يمكنك إرشاد
                متصفحك إلى رفض جميع ملفات تعريف الارتباط أو للإشارة إلى وقت
                إرسال ملف تعريف الارتباط. ومع ذلك ، إذا كنت لا تقبل ملفات تعريف
                الارتباط ، فقد لا تتمكن من ذلك استخدام بعض أجزاء من خدمتنا. ما
                لم تقم بتعديل ملف إعداد المتصفح بحيث يرفض ملفات تعريف الارتباط ،
                يجوز لخدمتنا استخدام ملفات تعريف الارتباط.
              </p>
            </li>
            <li class="privacy__li">
              <p class="privacy__paragraph">
                {""}
                <strong> ملفات تعريف ارتباط الفلاش. </strong> بعض ميزات خدمتنا
                قد تستخدم كائنات محلية مخزنة (أو ملفات تعريف ارتباط Flash) لجمع
                و تخزين معلومات حول تفضيلاتك أو نشاطك على موقعنا خدمة. لا تتم
                إدارة ملفات تعريف ارتباط الفلاش بواسطة نفس المتصفح الإعدادات مثل
                تلك المستخدمة مع ملفات تعريف الارتباط للمتصفح. للمزيد من
                المعلومات حول كيفية حذف ملفات تعريف الارتباط Flash ، يرجى التحقق
                من "أين يمكنني قم بتغيير الإعدادات الخاصة بتعطيل أو حذف المشاركة
                المحلية أشياء؟"{" "}
              </p>
            </li>

            <li class="privacy__li">
              <p class="privacy__paragraph">
                {" "}
                <strong> إشارات الويب. </strong> أقسام معينة من خدمتنا وقد تحتوي
                رسائل البريد الإلكتروني الخاصة بنا على ملفات إلكترونية صغيرة
                تُعرف باسم الويب إشارات (يشار إليها أيضًا باسم gifs الواضحة
                وعلامات البكسل و صور متحركة أحادية البكسل) تسمح للشركة ، على
                سبيل المثال ، بـ عد المستخدمين الذين زاروا تلك الصفحات أو فتحوا
                بريدًا إلكترونيًا و لإحصائيات مواقع الويب الأخرى ذات الصلة (على
                سبيل المثال ، تسجيل ملفات شعبية قسم معين والتحقق من النظام
                والخادم النزاهة).
              </p>
            </li>
          </ul>

          <p class="privacy__paragraph">
            {" "}
            يمكن أن تكون ملفات تعريف الارتباط "ثابتة" أو "جلسة". ملفات تعريف
            الارتباط الدائمة تظل على جهاز الكمبيوتر الشخصي أو الجهاز المحمول
            الخاص بك عندما تذهب في وضع عدم الاتصال ، بينما يتم حذف ملفات تعريف
            ارتباط الجلسة بمجرد إغلاق ملف متصفح الإنترنت.
          </p>

          <p class="privacy__paragraph">
            نحن نستخدم ملفات تعريف الارتباط الخاصة بالجلسة وملفات تعريف الارتباط
            الدائمة للأغراض المحددة أقل:{" "}
          </p>
          <ul class="privacy__ul">
            <li class="privacy__li">
              <p class="privacy__paragraph">
                {" "}
                <strong>ملفات تعريف الارتباط الضرورية / الأساسية</strong>{" "}
                <br></br>
              </p>
              <p class="privacy__paragraph">النوع: ملفات تعريف ارتباط الجلسة</p>

              <p class="privacy__paragraph">بإدارة: Us</p>
              <p class="privacy__paragraph">
                الغرض: ملفات تعريف الارتباط هذه ضرورية لتزويدك بها الخدمات
                المتاحة من خلال الموقع ولتمكينك من استخدامها بعض ميزاته. أنها
                تساعد على مصادقة المستخدمين و منع الاستخدام الاحتيالي لحسابات
                المستخدمين. بدون ملفات تعريف الارتباط هذه ، لا يمكن توفير
                الخدمات التي طلبتها ، ونحن استخدم ملفات تعريف الارتباط هذه فقط
                لتزويدك بهذه الخدمات.
              </p>
            </li>

            <li class="privacy__li">
              <p class="privacy__paragraph">
                {" "}
                <strong>
                  سياسة ملفات تعريف الارتباط / ملفات تعريف الارتباط بقبول
                  الإشعار
                </strong>{" "}
                <br></br>
              </p>
              <p class="privacy__paragraph">
                النوع: ملفات تعريف الارتباط الدائمة
              </p>

              <p class="privacy__paragraph">بإدارة: Us</p>
              <p class="privacy__paragraph">
                الغرض: تحدد ملفات تعريف الارتباط هذه ما إذا كان المستخدمون قد
                وافقوا على الاستخدام من ملفات تعريف الارتباط على الموقع.
              </p>
            </li>
            <li class="privacy__li">
              <p class="privacy__paragraph">
                {" "}
                <strong>ملفات تعريف الارتباط الوظيفية</strong> <br></br>
              </p>
              <p class="privacy__paragraph">
                النوع: ملفات تعريف الارتباط الدائمة
              </p>

              <p class="privacy__paragraph">بإدارة: Us</p>
              <p class="privacy__paragraph">
                الغرض: تسمح لنا ملفات تعريف الارتباط هذه بتذكر الاختيارات التي
                تقوم بها عندما تستخدم موقع الويب ، مثل تذكر تفاصيل تسجيل الدخول
                الخاصة بك أو تفضيل اللغة. الغرض من ملفات تعريف الارتباط هذه هو
                تزودك بتجربة شخصية أكثر ولتجنبك الاضطرار إلى إعادة إدخال
                تفضيلاتك في كل مرة تستخدم فيها ملف موقع الكتروني.{" "}
              </p>
            </li>
          </ul>

          <p class="privacy__paragraph">
            لمزيد من المعلومات حول ملفات تعريف الارتباط التي نستخدمها وخياراتك
            فيما يتعلق بملفات تعريف الارتباط ، يرجى زيارة سياسة ملفات تعريف
            الارتباط أو ملفات تعريف الارتباط قسم من سياسة الخصوصية الخاصة بنا.{" "}
          </p>

          <h2 class="privacy__subtitle">استخدام بياناتك الشخصية</h2>

          <p class="privacy__paragraph">
            يجوز للشركة استخدام البيانات الشخصية للأغراض التالية:{" "}
          </p>

          <ul class="privacy__ul">
            <li class="privacy__li">
              <p class="privacy__paragraph">
                {" "}
                <strong> لتقديم خدماتنا وصيانتها ، </strong> بما في ذلك لمراقبة
                استخدام خدمتنا.{" "}
              </p>
            </li>

            <li class="privacy__li">
              <p class="privacy__paragraph">
                {" "}
                <strong> لإدارة حسابك: </strong>
                لإدارة تسجيلك كمستخدم للخدمة. ال يمكن أن تمنحك البيانات الشخصية
                التي تقدمها وصولاً إلى بيانات مختلفة وظائف الخدمة المتاحة لك
                بصفتك مستخدم مسجل.{" "}
              </p>
            </li>
            <li class="privacy__li">
              <p class="privacy__paragraph">
                {" "}
                <strong> لتنفيذ عقد: </strong>
                التطوير والامتثال والتعهد بعقد الشراء للمنتجات أو العناصر أو
                الخدمات التي اشتريتها أو لأي منها عقد آخر معنا من خلال الخدمة.{" "}
              </p>
            </li>
            <li class="privacy__li">
              <p class="privacy__paragraph">
                {" "}
                <strong> للاتصال بك: </strong> للاتصال بك عبر البريد الإلكتروني
                ، المكالمات الهاتفية أو الرسائل النصية القصيرة أو أي أشكال
                إلكترونية أخرى معادلة الاتصالات ، مثل التنبيهات الفورية لتطبيق
                الهاتف المحمول فيما يتعلق بالتحديثات أو الاتصالات الإعلامية
                المتعلقة بـ الوظائف أو المنتجات أو الخدمات المتعاقد عليها ، بما
                في ذلك تحديثات الأمان ، عند الضرورة أو معقولة بالنسبة لهم تطبيق.
              </p>
            </li>
            <li class="privacy__li">
              <p class="privacy__paragraph">
                {" "}
                <strong> لتزويدك </strong> بالأخبار والعروض الخاصة و معلومات
                عامة عن السلع والخدمات والأحداث الأخرى التي نحن نقدم مشابهة لتلك
                التي لديك بالفعل اشتريت أو استفسرت عما لم تكن قد اخترت عدم
                الاستلام مثل هذه المعلومة.{" "}
              </p>
            </li>
            <li class="privacy__li">
              <p class="privacy__paragraph">
                {" "}
                <strong> لإدارة طلباتك: </strong> للحضور والإدارة طلباتك لنا.{" "}
              </p>
            </li>
            <li class="privacy__li">
              <p class="privacy__paragraph">
                {" "}
                <strong> بالنسبة إلى عمليات نقل الأعمال: </strong> قد نستخدم
                ملفات معلومات لتقييم أو إجراء الاندماج أو التجريد ، إعادة
                الهيكلة أو إعادة التنظيم أو حل أو بيع أخرى أو نقل بعض أو كل
                أصولنا ، سواء كان ذلك قيد التنفيذ القلق أو كجزء من الإفلاس أو
                التصفية أو ما شابه ذلك ، حيث البيانات الشخصية التي نحتفظ بها حول
                خدمتنا المستخدمين من بين الأصول المنقولة.{" "}
              </p>
            </li>
            <li class="privacy__li">
              <p class="privacy__paragraph">
                {" "}
                <strong> لأغراض أخرى: </strong> قد نستخدم معلوماتك لأغراض أخرى ،
                مثل تحليل البيانات ، وتحديد الاستخدام الاتجاهات ، وتحديد فعالية
                الترويج لدينا الحملات ولتقييم وتحسين خدماتنا ومنتجاتنا الخدمات
                والتسويق وتجربتك.{" "}
              </p>
            </li>
          </ul>

          <p class="privacy__paragraph">
            قد نشارك معلوماتك الشخصية في المواقف التالية:
          </p>

          <ul class="privacy__ul">
            <li class="privacy__li">
              <p class="privacy__paragraph">
                {" "}
                <strong> مع مزودي الخدمة: </strong> يجوز لنا مشاركة المعلومات
                الشخصية مع مزودي الخدمة لمراقبة و تحليل استخدام خدمتنا ، للاتصال
                بك.{" "}
              </p>
            </li>

            <li class="privacy__li">
              <p class="privacy__paragraph">
                {" "}
                <strong> لنقل الأعمال: </strong>
                يجوز لنا مشاركة أو نقل معلوماتك الشخصية فيما يتعلق مع ، أو أثناء
                المفاوضات ، بشأن أي عملية اندماج أو بيع للشركة الأصول أو التمويل
                أو الاستحواذ على كل أو جزء من عمل لشركة أخرى.{" "}
              </p>
            </li>
            <li class="privacy__li">
              <p class="privacy__paragraph">
                {" "}
                <strong> مع الشركات التابعة: </strong> قد نشارك معلوماتك مع
                الشركات التابعة لنا ، وفي هذه الحالة سنطلب ذلك الشركات التابعة
                لاحترام سياسة الخصوصية هذه. تشمل الشركات التابعة لنا الشركة الأم
                وأي شركات تابعة أخرى ، مشروع مشترك الشركاء أو الشركات الأخرى
                التي نسيطر عليها أو التي تخضع لها السيطرة المشتركة معنا.{" "}
              </p>
            </li>
            <li class="privacy__li">
              <p class="privacy__paragraph">
                {" "}
                <strong> مع شركاء الأعمال: </strong> قد نشاركك المعلومات مع
                شركائنا في العمل لنقدم لك بعض المعلومات المنتجات أو الخدمات أو
                العروض الترويجية. {""}{" "}
              </p>
            </li>
            <li class="privacy__li">
              <p class="privacy__paragraph">
                {" "}
                <strong> مع مستخدمين آخرين: </strong> عندما تشارك معلومات شخصية
                المعلومات أو التفاعل بطريقة أخرى في الأماكن العامة مع الآخرين
                المستخدمين ، قد يتم عرض هذه المعلومات من قبل جميع المستخدمين وقد
                يتم عرضها وزعت علنا ​​في الخارج.{" "}
              </p>
            </li>
            <li class="privacy__li">
              <p class="privacy__paragraph">
                {" "}
                <strong> بموافقتك: </strong> يجوز لنا الكشف عن المعلومات الشخصية
                لأي غرض آخر بموافقتك.{" "}
              </p>
            </li>
          </ul>

          <h2 class="privacy__subtitle">الاحتفاظ ببياناتك الشخصية</h2>

          <p class="privacy__paragraph">
            ستحتفظ الشركة ببياناتك الشخصية فقط طالما هي ضرورية للأغراض المنصوص
            عليها في سياسة الخصوصية هذه. ونحن سوف الاحتفاظ ببياناتك الشخصية
            واستخدامها بالقدر اللازم للامتثال مع التزاماتنا القانونية (على سبيل
            المثال ، إذا طُلب منا ذلك الاحتفاظ ببياناتك للامتثال للقوانين
            المعمول بها) ، وحل النزاعات ، وتنفيذ اتفاقياتنا وسياساتنا القانونية.{" "}
          </p>
          <p class="privacy__paragraph">
            ستحتفظ الشركة أيضًا ببيانات الاستخدام للتحليل الداخلي المقاصد. يتم
            الاحتفاظ ببيانات الاستخدام بشكل عام لفترة أقصر تبلغ الوقت ، إلا
            عندما يتم استخدام هذه البيانات لتعزيز الأمن أو ل تحسين وظائف خدمتنا
            ، أو نحن قانونيًا ملزم بالاحتفاظ بهذه البيانات لفترات زمنية أطول.{" "}
          </p>

          <h2 class="privacy__subtitle">نقل بياناتك الشخصية</h2>

          <p class="privacy__paragraph">
            تتم معالجة معلوماتك ، بما في ذلك البيانات الشخصية ، على مكاتب تشغيل
            الشركة وفي أي أماكن أخرى حيث تقع الأطراف المشاركة في المعالجة. هذا
            يعني أن هذا يمكن نقل المعلومات إلى أجهزة الكمبيوتر والاحتفاظ بها
            عليها يقع خارج ولايتك أو مقاطعتك أو بلدك أو غير ذلك الولاية القضائية
            الحكومية حيث قد تختلف قوانين حماية البيانات من تلك الموجودة في
            ولايتك القضائية.{" "}
          </p>
          <p class="privacy__paragraph">
            موافقتك على سياسة الخصوصية هذه متبوعة بتقديمك لـ هذه المعلومات تمثل
            موافقتك على هذا النقل.{" "}
          </p>
          <p class="privacy__paragraph">
            موافقتك على هذه الخطوة خلفتك هذه المعلومات تمثل موافقتك على هذا
            النقل.{" "}
          </p>

          <h2 class="privacy__subtitle">الإفصاح عن بياناتك الشخصية</h2>

          <p class="privacy__sub">المعاملات التجارية</p>

          <p class="privacy__paragraph">
            إذا كانت الشركة متورطة في عملية اندماج أو استحواذ أو بيع أصول ، قد
            يتم نقل بياناتك الشخصية. سوف نقدم إشعار من قبل يتم نقل بياناتك
            الشخصية وتصبح خاضعة لملف سياسة الخصوصية.
          </p>

          <p class="privacy__sub"> تطبيق القانون </p>

          <p class="privacy__paragraph">
            في ظل ظروف معينة ، قد يُطلب من الشركة الإفصاح بياناتك الشخصية إذا
            طُلب منك ذلك بموجب القانون أو ردًا على طلبات صالحة من قبل السلطات
            العامة (مثل محكمة أو حكومة وكالة).
          </p>

          <p class="privacy__sub"> متطلبات قانونية أخرى </p>

          <p class="privacy__paragraph">
            قد تفصح الشركة عن بياناتك الشخصية بحسن نية أن هذا الإجراء ضروري من
            أجل:
          </p>

          <ul class="privacy__ul">
            <li class="privacy__li">
              <p class="privacy__paragraph"> الامتثال لالتزام قانوني </p>
            </li>
            <li class="privacy__li">
              <p class="privacy__paragraph">
                حماية والدفاع عن حقوق أو ممتلكات الشركة
              </p>
            </li>
            <li class="privacy__li">
              <p class="privacy__paragraph">
                منع أو التحقيق في أي مخالفات محتملة تتعلق بـ الخدمة
              </p>
            </li>
            <li class="privacy__li">
              <p class="privacy__paragraph">
                حماية السلامة الشخصية لمستخدمي الخدمة أو عام
              </p>
            </li>
            <li class="privacy__li">
              <p class="privacy__paragraph"> الحماية من المسؤولية القانونية </p>
            </li>
          </ul>

          <h2 class="privacy__subtitle"> أمان بياناتك الشخصية </h2>

          <p class="privacy__paragraph">
            أمان بياناتك الشخصية مهم بالنسبة لنا ، ولكن تذكر لا توجد طريقة
            للإرسال عبر الإنترنت ، أو طريقة التخزين الإلكتروني آمن بنسبة 100٪.
            بينما نسعى جاهدين لاستخدام وسائل مقبولة تجاريًا لحماية بياناتك
            الشخصية ، نحن لا يمكن أن تضمن أمنها المطلق.
          </p>

          <h2 class="privacy__title"> خصوصية الأطفال </h2>

          <p class="privacy__paragraph">
            لا تخاطب خدمتنا أي شخص دون سن 13 عامًا جمع معلومات التعريف الشخصية
            عن عمد من أي شخص تحت سن 13. إذا كنت أحد الوالدين أو وصيًا وأنت على
            علم بأن طفلك قد زودنا ببيانات شخصية ، من فضلك اتصل بنا. إذا علمنا
            أننا قد جمعنا بيانات شخصية من أي شخص يقل عمره عن 13 عامًا دون التحقق
            من صحة الوالدين الموافقة ، نتخذ خطوات لإزالة تلك المعلومات من
            خوادمنا.
          </p>
          <p class="privacy__paragraph">
            إذا احتجنا إلى الاعتماد على الموافقة كأساس قانوني لمعالجة ملف
            المعلومات وبلدك يتطلب موافقة أحد الوالدين ، يجوز لنا ذلك تتطلب
            موافقة والديك قبل أن نجمعها ونستخدمها معلومة.
          </p>
          <h2 class="privacy__title"> روابط لمواقع أخرى </h2>

          <p class="privacy__paragraph">
            قد تحتوي خدمتنا على روابط لمواقع أخرى ليست كذلك التي تديرها لنا. إذا
            قمت بالنقر فوق ارتباط جهة خارجية ، فستفعل ذلك موجهة إلى موقع الطرف
            الثالث. ننصحك بشدة أن مراجعة سياسة الخصوصية لكل موقع تزوره.
          </p>

          <p class="privacy__paragraph">
            ليس لدينا سيطرة ولا نتحمل أي مسؤولية عن المحتوى أو سياسات الخصوصية
            أو الممارسات الخاصة بأي مواقع أو مواقع خاصة بطرف ثالث خدمات.
          </p>

          <h2 class="privacy__title"> التغييرات في سياسة الخصوصية هذه </h2>
          <p class="privacy__paragraph">
            قد نقوم بتحديث سياسة الخصوصية الخاصة بنا من وقت لآخر. سنقوم بإخطار
            لك أي تغييرات عن طريق نشر سياسة الخصوصية الجديدة على هذه الصفحة.
          </p>
          <p class="privacy__paragraph">
            سنخبرك عبر البريد الإلكتروني و / أو إشعار بارز على موقعنا الخدمة ،
            قبل أن يصبح التغيير ساريًا وقم بتحديث "Last تم التحديث "في الجزء
            العلوي من سياسة الخصوصية هذه.
          </p>
          <p class="privacy__paragraph">
            يُنصح بمراجعة سياسة الخصوصية هذه بشكل دوري لأي التغييرات. التغييرات
            على سياسة الخصوصية هذه تكون فعالة عندما تكون كذلك المنشورة في هذه
            الصفحة.
          </p>

          <h2 class="privacy__title"> اتصل بنا </h2>

          <p class="privacy__paragraph">
            إذا كان لديك أي أسئلة حول سياسة الخصوصية هذه ، يمكنك الاتصال نحن:
          </p>

          <ul class="privacy__ul">
            <li class="privacy__li">
              <p class="privacy__paragraph">
                {" "}
                بالبريد الإلكتروني: zubair@maqawal.com{" "}
              </p>
            </li>
          </ul>
        </div>
      </Wrapper>
      <Footer></Footer>
    </>
  );
};

export default PrivacyPolicyPage;

const Wrapper = styled.div`
  color: var(--clr-black);
  .privacy {
    max-width: 115rem;
    padding: 0rem 3rem;
    padding-top: 6rem;
    margin: 0rem auto;
  }

  .privacy__title {
    font-size: 3.6rem;
    margin-bottom: 3rem;
  }

  .privacy__subtitle {
    font-size: 3rem;
    margin-bottom: 3rem;
  }

  .privacy__sub {
    font-size: 2.6rem;
    margin-bottom: 3rem;
    font-weight: 600;
  }

  .privacy__paragraph {
    font-weight: normal;
    font-style: normal;
    line-height: 1.4;
    font-size: 1.7rem;
    margin-bottom: 2rem;
  }

  .privacy__ul {
    padding-left: 3rem;
  }

  .privacy__li {
    font-size: 2rem;
  }
`;
